In [1]:
import pandas as pd 
df2 = pd.read_csv('demographics.csv')
df2.head()

,cust_id,age,annual_income,employment_length,employment_type,education,marital_status,num_dependents
0,10000,41,$61800,2.2,Full-time,Graduate,Married,2
1,10001,38,"28,600",7.0,FULL_TIME,High School,Married,0
2,10002,18,"$20,700",0.8,FULL_TIME,Bachelor,Single,0
3,10003,27,"31,400",4.8,Full Time,Bachelor,Single,0
4,10004,26,$24600,5.2,Fulltime,High School,Single,0

In [2]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 89999 entries, 0 to 89998
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   cust_id            89999 non-null  int64
 1   age                89999 non-null  int64
 2   annual_income      89999 non-null  object
 3   employment_length  87746 non-null  float64
 4   employment_type    89999 non-null  object
 5   education          89999 non-null  object
 6   marital_status     89999 non-null  object
 7   num_dependents     89999 non-null  int64
dtypes: float64(1), int64(3), object(4)
memory usage: 5.5+ MB

In [3]:
df2.rename(columns={'cust_id':'customer_id'}, inplace=True)

In [4]:
df2.head()

,customer_id,age,annual_income,employment_length,employment_type,education,marital_status,num_dependents
0,10000,41,$61800,2.2,Full-time,Graduate,Married,2
1,10001,38,"28,600",7.0,FULL_TIME,High School,Married,0
2,10002,18,"$20,700",0.8,FULL_TIME,Bachelor,Single,0
3,10003,27,"31,400",4.8,Full Time,Bachelor,Single,0
4,10004,26,$24600,5.2,Fulltime,High School,Single,0

In [5]:
df2['age'].value_counts()

39    3148
37    3117
38    3097
36    3085
40    3043
34    3037
35    3032
41    3002
33    2873
43    2838
42    2816
32    2804
44    2759
31    2741
30    2566
45    2549
29    2445
46    2404
28    2293
47    2291
27    2256
48    2150
49    1993
26    1941
50    1835
25    1790
51    1717
24    1625
23    1536
52    1528
53    1462
22    1409
21    1258
54    1232
20    1129
55    1110
56     982
19     978
18     862
57     841
58     743
59     646
60     576
61     438
62     401
63     302
64     275
65     220
66     173
67     151
68     127
69      99
70      93
71      65
72      47
73      41
74      28
Name: age, dtype: int64

In [6]:
df2['annual_income'] = df2['annual_income'].replace('[\$,]', '', regex=True).astype(float)
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 89999 entries, 0 to 89998
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   customer_id        89999 non-null  int64
 1   age                89999 non-null  int64
 2   annual_income      89999 non-null  float64
 3   employment_length  87746 non-null  float64
 4   employment_type    89999 non-null  object
 5   education          89999 non-null  object
 6   marital_status     89999 non-null  object
 7   num_dependents     89999 non-null  int64
dtypes: float64(2), int64(3), object(3)
memory usage: 5.5+ MB

In [9]:
df2['employment_type'].unique()

array(['Full-time', 'FULL_TIME', 'Full Time', 'Fulltime', 'Part Time',
       'Self Employed', 'FT', 'Self Emp', 'Contractor', 'Self-employed',
       'SELF_EMPLOYED', 'Contract', 'PART_TIME', 'CONTRACT', 'PT',
       'Part-time'], dtype=object)

In [10]:
# Employment type mapping
employment_map = {
    'Full-time': 'Full-time', 'FULL_TIME': 'Full-time', 'Full Time': 'Full-time', 'Fulltime': 'Full-time', 'FT': 'Full-time',
    'Part Time': 'Part-time', 'PART_TIME': 'Part-time', 'PT': 'Part-time', 'Part-time': 'Part-time',
    'Self Employed': 'Self-employed', 'Self-employed': 'Self-employed', 'SELF_EMPLOYED': 'Self-employed',
    'Contractor': 'Contract', 'Contract': 'Contract', 'CONTRACT': 'Contract'
}

# Apply mapping
df2['employment_type'] = df2['employment_type'].map(employment_map)
df2['employment_type'].unique()

array(['Full-time', 'Part-time', 'Self-employed', nan, 'Contract'],
      dtype=object)

In [12]:
mode_type = df2['employment_type'].mode()[0]
df2['employment_type'].fillna(mode_type, inplace=True)
df2['employment_type'].unique()

array(['Full-time', 'Part-time', 'Self-employed', 'Contract'],
      dtype=object)

In [15]:
df2['education'].unique()

array(['Graduate', 'High School', 'Bachelor', 'Some College', 'Advanced'],
      dtype=object)

In [16]:
df2['marital_status'].unique()

array(['Married', 'Single', 'Divorced'], dtype=object)

In [18]:
df2['num_dependents'].value_counts()

1    30916
0    28808
2    18464
3     8143
4     2669
5      999
Name: num_dependents, dtype: int64

In [21]:
mode_type = df2['employment_length'].mode()[0]
df2['employment_length'].fillna(mode_type, inplace=True)
df2.isnull().sum()

customer_id          0
age                  0
annual_income        0
employment_length    0
employment_type      0
education            0
marital_status       0
num_dependents       0
dtype: int64

In [22]:
from sklearn.preprocessing import LabelEncoder
categorical_cols = ['employment_type', 'education', 'marital_status']
for col in categorical_cols:
    le = LabelEncoder()
    df2[col] = le.fit_transform(df2[col].astype(str))
df2.head()

,customer_id,age,annual_income,employment_length,employment_type,education,marital_status,num_dependents
0,10000,41,61800.0,2.2,1,2,1,2
1,10001,38,28600.0,7.0,1,3,1,0
2,10002,18,20700.0,0.8,1,1,2,0
3,10003,27,31400.0,4.8,1,1,2,0
4,10004,26,24600.0,5.2,1,3,2,0

In [24]:
df2.to_csv("cleaned_demographic.csv", index=False)